# Edit/insert constraint/create clock
create_clock -name i_CLK -period 10.000 [get_ports {i_CLK}]


# Automatically apply a generate clock on the output of phase-locked loops (PLLs)
# This command can be safely left in the SDC even if no PLLs exist in the design

derive_pll_clocks

# Constrain the input I/O path

set_input_delay -clock clk -max 3.000 [all_inputs]

set_input_delay -clock clk -min 2.000 [all_inputs]

# Constrain the output I/O path

set_output_delay -clock clk -max 3.000 [all_inputs]

set_output_delay -clock clk -min 2.000 [all_inputs]